namespace Lab1.Helpers
{
    public static class Alphabet
    {
        public static string Eng = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";

        public static string Rus = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
    }

    public static class AlphabetFrequency
    {
        public static double[] Eng = { 0.08167, 0.01492, 0.02782, 0.04253, 0.12702,
            0.0228, 0.02015, 0.06094, 0.06966, 0.00153, 0.00772, 0.04025, 0.02406,
            0.06749, 0.07507, 0.01929, 0.00095, 0.05987, 0.06327, 0.09056, 0.02758,
            0.00978, 0.0236, 0.0015, 0.01974, 0.00074 };

        public static double[] Rus = { 0.07821, 0.01732, 0.04491, 0.01698, 0.03103, 0.08567,
            0.0007, 0.01082, 0.01647, 0.06777, 0.01041, 0.03215, 0.04813, 0.03139, 0.0685,
            0.11394, 0.02754, 0.04234, 0.05382, 0.06443, 0.02882, 0.00132, 0.00833, 0.00333,
            0.01645, 0.00775, 0.00331, 0.00023, 0.01854, 0.02106, 0.0031, 0.00544, 0.01979 };
    }
}
